sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
static void display_bridge_v8_diff_reset_to(esp_lv_adapter_display_bridge_v8_t *impl,
                                            uint8_t current_index)
{
    memset(&impl->diff_tracker, 0, sizeof(impl->diff_tracker));
    if (current_index < DISPLAY_BRIDGE_V8_DIFF_BUFFER_COUNT) {
        impl->diff_tracker.buffers[current_index].valid = true;
    }
}

static void display_bridge_v8_diff_reset(esp_lv_adapter_display_bridge_v8_t *impl)
{
    display_bridge_v8_diff_reset_to(
        impl, display_bridge_v8_diff_buffer_index(impl, impl->disp_fb));
}

static bool display_bridge_v8_diff_rect_valid(const lv_area_t *rect)
{
    return rect->x2 >= rect->x1 && rect->y2 >= rect->y1;
}

static bool display_bridge_v8_diff_rects_touch_or_overlap(const lv_area_t *a,
                                                          const lv_area_t *b)
{
    bool x_overlap = a->x1 <= b->x2 && a->x2 >= b->x1;
    bool y_overlap = a->y1 <= b->y2 && a->y2 >= b->y1;
    bool x_adjacent = a->x2 + 1 == b->x1 || b->x2 + 1 == a->x1;
    bool y_adjacent = a->y2 + 1 == b->y1 || b->y2 + 1 == a->y1;
    return (x_overlap && y_overlap) || (x_adjacent && y_overlap) ||
           (y_adjacent && x_overlap);
}

static bool display_bridge_v8_diff_merge_one(lv_area_t *rects,
                                             uint16_t *count,
                                             uint16_t capacity,
                                             lv_area_t rect)
{
    uint16_t index = 0;
    while (index < *count) {
        if (!display_bridge_v8_diff_rects_touch_or_overlap(&rects[index], &rect)) {
            ++index;
            continue;
        }
        rect.x1 = LV_MIN(rect.x1, rects[index].x1);
        rect.y1 = LV_MIN(rect.y1, rects[index].y1);
        rect.x2 = LV_MAX(rect.x2, rects[index].x2);
        rect.y2 = LV_MAX(rect.y2, rects[index].y2);
        rects[index] = rects[--(*count)];
        index = 0;
    }
    if (*count >= capacity) {
        return false;
    }
    rects[(*count)++] = rect;
    return true;
}

static void display_bridge_v8_diff_area_to_physical(
    const esp_lv_adapter_display_bridge_v8_t *impl,
    const lv_area_t *logical,
    lv_area_t *physical)
{
    const esp_lv_adapter_rotation_t rotation = bridge_rotation(impl);
    if (rotation == ESP_LV_ADAPTER_ROTATE_0) {
        *physical = *logical;
        return;
    }

    int x1 = 0;
    int y1 = 0;
    int x2 = 0;
    int y2 = 0;
    display_coord_to_phy(logical->x1, logical->y1, &x1, &y1,
                         rotation, bridge_h_res(impl), bridge_v_res(impl));
    display_coord_to_phy(logical->x2, logical->y2, &x2, &y2,
                         rotation, bridge_h_res(impl), bridge_v_res(impl));

    physical->x1 = LV_MIN(x1, x2);
    physical->y1 = LV_MIN(y1, y2);
    physical->x2 = LV_MAX(x1, x2);
    physical->y2 = LV_MAX(y1, y2);
}

static bool display_bridge_v8_diff_capture_current(
    const esp_lv_adapter_display_bridge_v8_t *impl,
    const lv_disp_t *disp,
    lv_area_t *current,
    uint16_t *current_count,
    bool to_physical)
{
    *current_count = 0;
    const esp_lv_adapter_rotation_t rotation = bridge_rotation(impl);
    const bool rotated = to_physical && rotation != ESP_LV_ADAPTER_ROTATE_0;
    const bool swapped = rotation == ESP_LV_ADAPTER_ROTATE_90 ||
                         rotation == ESP_LV_ADAPTER_ROTATE_270;
    const int32_t logical_w = rotated && swapped ?
                              bridge_v_res(impl) : bridge_h_res(impl);
    const int32_t logical_h = rotated && swapped ?
                              bridge_h_res(impl) : bridge_v_res(impl);
    uint16_t count = LV_MIN(disp->inv_p, (uint16_t)LV_INV_BUF_SIZE);
    for (uint16_t index = 0; index < count; ++index) {
        if (disp->inv_area_joined[index]) {
            continue;
        }
        lv_area_t rect = disp->inv_areas[index];
        rect.x1 = LV_MAX(rect.x1, 0);
        rect.y1 = LV_MAX(rect.y1, 0);
        rect.x2 = LV_MIN(rect.x2, logical_w - 1);
        rect.y2 = LV_MIN(rect.y2, logical_h - 1);
        if (rotated) {
            display_bridge_v8_diff_area_to_physical(impl, &rect, &rect);
            rect.x1 = LV_MAX(rect.x1, 0);
            rect.y1 = LV_MAX(rect.y1, 0);
            rect.x2 = LV_MIN(rect.x2, (int32_t)bridge_h_res(impl) - 1);
            rect.y2 = LV_MIN(rect.y2, (int32_t)bridge_v_res(impl) - 1);
        }
        if (!display_bridge_v8_diff_rect_valid(&rect)) {
            continue;
        }
        if (*current_count >= DISPLAY_BRIDGE_V8_DIFF_RECT_CAPACITY) {
            *current_count = 0;
            return false;
        }
        current[(*current_count)++] = rect;
    }
    return *current_count != 0;
}

static bool display_bridge_v8_diff_append(lv_area_t *rects,
                                          uint16_t *count,
                                          uint16_t capacity,
                                          lv_area_t rect)
{
    if (!display_bridge_v8_diff_rect_valid(&rect)) {
        return true;
    }
    if (*count >= capacity) {
        return false;
    }
    rects[(*count)++] = rect;
    return true;
}

static bool display_bridge_v8_diff_subtract_one(lv_area_t source,
                                                lv_area_t cut,
                                                lv_area_t *out,
                                                uint16_t *out_count,
                                                uint16_t capacity)
{
    lv_area_t overlap = {
        .x1 = LV_MAX(source.x1, cut.x1),
        .y1 = LV_MAX(source.y1, cut.y1),
        .x2 = LV_MIN(source.x2, cut.x2),
        .y2 = LV_MIN(source.y2, cut.y2),
    };
    if (!display_bridge_v8_diff_rect_valid(&overlap)) {
        return display_bridge_v8_diff_append(out, out_count, capacity, source);
    }

    return display_bridge_v8_diff_append(out, out_count, capacity, (lv_area_t) {
        source.x1, source.y1, source.x2, overlap.y1 - 1
    }) &&
    display_bridge_v8_diff_append(out, out_count, capacity, (lv_area_t) {
        source.x1, overlap.y2 + 1, source.x2, source.y2
    }) &&
    display_bridge_v8_diff_append(out, out_count, capacity, (lv_area_t) {
        source.x1, overlap.y1, overlap.x1 - 1, overlap.y2
    }) &&
    display_bridge_v8_diff_append(out, out_count, capacity, (lv_area_t) {
        overlap.x2 + 1, overlap.y1, source.x2, overlap.y2
    });
}

