sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
static inline bool bridge_mode_needs_submit_gated_frame_complete(const esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return false;
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;

    if (mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_PARTIAL ||
            mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_PARTIAL) {
        return false;
    }

    return impl->cfg.base.profile.interface == ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI &&
           bridge_mode_uses_buf_switch_release(mode);
}

static inline void display_bridge_v8_mark_frame_buf_submit(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!bridge_mode_needs_submit_gated_frame_complete(impl)) {
        return;
    }

    portENTER_CRITICAL(&impl->double_sync_lock);
    impl->frame_buf_submit_pending = true;
    portEXIT_CRITICAL(&impl->double_sync_lock);
}

static bool IRAM_ATTR display_bridge_v8_consume_frame_buf_submit_isr(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!bridge_mode_needs_submit_gated_frame_complete(impl)) {
        return true;
    }

    bool submit_pending = false;
    portENTER_CRITICAL_ISR(&impl->double_sync_lock);
    submit_pending = impl->frame_buf_submit_pending;
    if (submit_pending) {
        impl->frame_buf_submit_pending = false;
    }
    portEXIT_CRITICAL_ISR(&impl->double_sync_lock);

    return submit_pending;
}

static esp_err_t display_bridge_v8_blit_full_frame(esp_lv_adapter_display_bridge_v8_t *impl,
                                                   void *frame_buffer,
                                                   bool record_flush_post)
{
    if (!impl || !impl->panel || !frame_buffer) {
        return ESP_ERR_INVALID_ARG;
    }

    if (record_flush_post) {
        display_bridge_vsync_record_flush_post(&impl->vsync_timing);
    }

    esp_err_t ret = display_lcd_blit_full(impl->panel, &impl->runtime, frame_buffer);
    if (ret == ESP_OK) {
        display_bridge_v8_mark_frame_buf_submit(impl);
    }

    return ret;
}

static TaskHandle_t display_bridge_v8_get_notify_task(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return NULL;
    }

    if (impl->notify_task) {
        return impl->notify_task;
    }

    esp_lv_adapter_context_t *ctx = esp_lv_adapter_get_context();
    return ctx ? ctx->task : NULL;
}

static esp_err_t display_bridge_v8_configure_double_wait_resource(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return ESP_ERR_INVALID_ARG;
    }

    const bool need_double_wait = bridge_mode_uses_double_switch_wait(impl->cfg.base.tear_avoid_mode);
    if (!need_double_wait) {
        if (impl->double_wait_sem) {
            vSemaphoreDeleteWithCaps(impl->double_wait_sem);
            impl->double_wait_sem = NULL;
        }
        return ESP_OK;
    }

    if (!impl->double_wait_sem) {
        impl->double_wait_sem = xSemaphoreCreateBinaryWithCaps(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
        if (!impl->double_wait_sem) {
            return ESP_ERR_NO_MEM;
        }
    } else {
        (void)xSemaphoreTake(impl->double_wait_sem, 0);
    }

    return ESP_OK;
}

static void display_bridge_v8_prime_double_buffers(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return;
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
    if (!bridge_mode_needs_double_prime(mode)) {
        return;
    }

    if (impl->runtime.rotation != ESP_LV_ADAPTER_ROTATE_0 ||
            impl->runtime.frame_buffer_count < 2 ||
            !impl->runtime.frame_buffers[0] ||
            !impl->runtime.frame_buffers[1] ||
            impl->runtime.frame_buffer_size == 0) {
        return;
    }

    memcpy(impl->runtime.frame_buffers[1], impl->runtime.frame_buffers[0], impl->runtime.frame_buffer_size);
    display_cache_msync_framebuffer(impl->runtime.frame_buffers[1], impl->runtime.frame_buffer_size);
}

static uint32_t display_bridge_v8_prepare_double_wait(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return 0;
    }

    if (impl->double_wait_sem) {
        (void)xSemaphoreTake(impl->double_wait_sem, 0);
    }

    uint32_t switch_seq = 0;
    portENTER_CRITICAL(&impl->double_sync_lock);
    impl->double_wait_active = false;
    switch_seq = impl->switch_seq;
    portEXIT_CRITICAL(&impl->double_sync_lock);

    return switch_seq;
}

static bool display_bridge_v8_arm_double_wait_after_submit(esp_lv_adapter_display_bridge_v8_t *impl,
                                                           uint32_t submitted_switch_seq)
{
    if (!impl) {
        return false;
    }

    bool need_wait = false;

    portENTER_CRITICAL(&impl->double_sync_lock);
    if (impl->switch_seq == submitted_switch_seq) {
        impl->double_wait_switch_seq = submitted_switch_seq;
        impl->double_wait_active = true;
        need_wait = true;
    } else {
        impl->double_wait_active = false;
    }
    portEXIT_CRITICAL(&impl->double_sync_lock);

    return need_wait;
}

static void display_bridge_v8_wait_double_ready(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl || !impl->double_wait_sem) {
        return;
    }

    while (true) {
        bool done = false;

        portENTER_CRITICAL(&impl->double_sync_lock);
        done = !impl->double_wait_active;
        portEXIT_CRITICAL(&impl->double_sync_lock);

        if (done) {
            return;
        }

        (void)xSemaphoreTake(impl->double_wait_sem, portMAX_DELAY);
    }
}

static bool IRAM_ATTR display_bridge_v8_complete_double_wait_isr(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return false;
    }

    bool notify = false;

    portENTER_CRITICAL_ISR(&impl->double_sync_lock);
    if (impl->double_wait_active && impl->switch_seq > impl->double_wait_switch_seq) {
        impl->double_wait_active = false;
        notify = true;
    }
    portEXIT_CRITICAL_ISR(&impl->double_sync_lock);

    return notify;
}

static esp_err_t display_bridge_v8_submit_double_buffer(esp_lv_adapter_display_bridge_v8_t *impl,
                                                        void *frame_buffer)
{
    if (!impl || !impl->panel || !frame_buffer) {
        return ESP_ERR_INVALID_ARG;
    }

