sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
    uint32_t submitted_switch_seq = display_bridge_v8_prepare_double_wait(impl);
    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, frame_buffer, true);
    if (ret != ESP_OK) {
        return ret;
    }

    /* If the switch already happened before we armed the wait, skip blocking. */
    if (display_bridge_v8_arm_double_wait_after_submit(impl, submitted_switch_seq)) {
        display_bridge_v8_wait_double_ready(impl);
    }
    return ESP_OK;
}

static size_t display_bridge_v8_i1_stride_bytes(uint16_t hor_res)
{
    uint16_t aligned = (hor_res + 7U) & ~7U;
    return (size_t)aligned / 8U;
}

static bool display_bridge_v8_prepare_mono(esp_lv_adapter_display_bridge_v8_t *impl,
                                           lv_disp_drv_t *drv,
                                           const lv_area_t *area,
                                           uint8_t **color_map)
{
    if (!impl || !drv || !area || !color_map || !*color_map) {
        return false;
    }

    if (impl->cfg.base.profile.mono_layout == ESP_LV_ADAPTER_MONO_LAYOUT_NONE) {
        return true;
    }

    if (LV_COLOR_DEPTH != 1) {
        ESP_LOGE(TAG, "Monochrome requires LV_COLOR_DEPTH=1");
        return false;
    }

    const esp_lv_adapter_rotation_t rotation = impl->cfg.base.profile.rotation;
    uint16_t phy_w = impl->cfg.base.profile.hor_res;
    uint16_t phy_h = impl->cfg.base.profile.ver_res;
    uint16_t log_w = (rotation == ESP_LV_ADAPTER_ROTATE_90 || rotation == ESP_LV_ADAPTER_ROTATE_270) ? phy_h : phy_w;
    size_t dst_stride = display_bridge_v8_i1_stride_bytes(phy_w);

    if (impl->cfg.base.profile.mono_layout == ESP_LV_ADAPTER_MONO_LAYOUT_HTILED) {
        if ((area->x1 % 8) != 0 || ((area->x2 + 1) % 8) != 0) {
            ESP_LOGW(TAG, "I1 htiled area not byte-aligned (x1=%d x2=%d)", area->x1, area->x2);
        }
        if (impl->cfg.base.profile.rotation == ESP_LV_ADAPTER_ROTATE_0) {
            *color_map += 8;
            return true;
        }
        if (!impl->cfg.mono_buf) {
            ESP_LOGE(TAG, "Monochrome HTILED buffer missing");
            return false;
        }
    } else {
        if (!impl->cfg.mono_buf) {
            ESP_LOGE(TAG, "Monochrome VTILED buffer missing");
            return false;
        }
    }

    size_t buf_size = (size_t)phy_w * phy_h / 8;
    memset(impl->cfg.mono_buf, 0x00, buf_size);

    /* V8 uses 1 byte per pixel (different from V9's packed I1 format) */
    uint8_t *src = *color_map;
    size_t src_stride_px = log_w;

    for (int y = area->y1; y <= area->y2; y++) {
        for (int x = area->x1; x <= area->x2; x++) {
            bool pixel = src[y * src_stride_px + x] != 0;
            int px, py;
            display_coord_to_phy(x, y, &px, &py, rotation, phy_w, phy_h);

            size_t offset;
            if (impl->cfg.base.profile.mono_layout == ESP_LV_ADAPTER_MONO_LAYOUT_HTILED) {
                offset = dst_stride * (size_t)py + (size_t)(px >> 3);
                if (offset < buf_size) {
                    uint8_t mask = (uint8_t)(1U << (7 - (px & 7)));
                    if (pixel) {
                        impl->cfg.mono_buf[offset] |= mask;
                    } else {
                        impl->cfg.mono_buf[offset] &= ~mask;
                    }
                }
            } else {
                offset = (size_t)phy_w * (size_t)(py >> 3) + (size_t)px;
                if (offset < buf_size) {
                    uint8_t mask = (uint8_t)(1U << (py & 7));
                    if (pixel) {
                        impl->cfg.mono_buf[offset] &= ~mask;
                    } else {
                        impl->cfg.mono_buf[offset] |= mask;
                    }
                }
            }
        }
    }
    *color_map = impl->cfg.mono_buf;
    return true;
}

#endif /* LVGL_VERSION_MAJOR < 9 */

/**********************
 *  FORWARD DECLARATIONS
 **********************/
#if LVGL_VERSION_MAJOR < 9

/* Lifecycle management */
static void display_bridge_v8_destroy(esp_lv_adapter_display_bridge_t *bridge);
static esp_err_t display_bridge_v8_update_panel(esp_lv_adapter_display_bridge_t *bridge,
                                                const esp_lv_adapter_display_runtime_config_t *cfg);

static void display_bridge_v8_set_area_rounder(esp_lv_adapter_display_bridge_t *bridge,
                                               void (*rounder_cb)(lv_area_t *, void *),
                                               void *user_data);
static void display_bridge_v8_set_draw_bitmap_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                        const esp_lv_adapter_draw_bitmap_callbacks_t *cbs,
                                                        void *user_ctx);

/* Core callbacks */
static void display_bridge_v8_flush_entry(esp_lv_adapter_display_bridge_t *bridge,
                                          void *disp_ref,
                                          const lv_area_t *area,
                                          uint8_t *color_map);
static void display_bridge_v8_set_dummy_draw(esp_lv_adapter_display_bridge_t *bridge, bool enable);
static void display_bridge_v8_set_dummy_draw_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                       const esp_lv_adapter_dummy_draw_callbacks_t *cbs,
                                                       void *user_ctx);
static esp_err_t display_bridge_v8_dummy_draw_blit(esp_lv_adapter_display_bridge_t *bridge,
                                                   int x_start,
                                                   int y_start,
                                                   int x_end,
                                                   int y_end,
                                                   const void *frame_buffer,
                                                   bool wait);
static void *display_bridge_v8_dummy_draw_get_free_buf(esp_lv_adapter_display_bridge_t *bridge);
static esp_err_t display_bridge_v8_dummy_draw_flush_buf(esp_lv_adapter_display_bridge_t *bridge,
                                                        void *frame_buffer);

/* VSync handling */
static bool display_bridge_v8_handle_vsync(esp_lv_adapter_display_bridge_v8_t *impl);
static bool display_bridge_v8_handle_frame_buf_complete(esp_lv_adapter_display_bridge_v8_t *impl);
static void display_bridge_v8_register_vsync(esp_lv_adapter_display_bridge_v8_t *impl);
static void display_bridge_v8_unregister_vsync(esp_lv_adapter_display_bridge_v8_t *impl);
static void display_bridge_v8_wait_for_buf_switch(esp_lv_adapter_display_bridge_v8_t *impl);
static bool display_bridge_v8_has_pending_submit(esp_lv_adapter_display_bridge_v8_t *impl);
static inline void display_bridge_v8_signal_dummy_draw_event(esp_lv_adapter_display_bridge_v8_t *impl,
                                                             uint32_t event_bit,
                                                             BaseType_t *need_yield);

#if CONFIG_SOC_MIPI_DSI_SUPPORTED
static bool display_bridge_v8_on_mipi_color_trans_done(esp_lcd_panel_handle_t panel,
                                                       esp_lcd_dpi_panel_event_data_t *event_data,
                                                       void *user_ctx);
static bool display_bridge_v8_on_mipi_frame_buf_complete(esp_lcd_panel_handle_t panel,
                                                         esp_lcd_dpi_panel_event_data_t *event_data,
                                                         void *user_ctx);
#endif

