sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
#if CONFIG_SOC_LCD_RGB_SUPPORTED
static bool display_bridge_v8_on_rgb_color_trans_done(esp_lcd_panel_handle_t panel,
                                                      const esp_lcd_rgb_panel_event_data_t *event_data,
                                                      void *user_ctx);
static bool display_bridge_v8_on_rgb_frame_complete(esp_lcd_panel_handle_t panel,
                                                    const esp_lcd_rgb_panel_event_data_t *event_data,
                                                    void *user_ctx);
#endif

static bool display_bridge_v8_on_io_color_trans_done(esp_lcd_panel_io_handle_t panel_io,
                                                     esp_lcd_panel_io_event_data_t *edata,
                                                     void *user_ctx);

/* Flush implementations */
static void display_bridge_v8_flush_default(esp_lv_adapter_display_bridge_v8_t *impl,
                                            lv_disp_drv_t *drv,
                                            const lv_area_t *area,
                                            uint8_t *color_map);
static void display_bridge_v8_flush_gpio_te(esp_lv_adapter_display_bridge_v8_t *impl,
                                            lv_disp_drv_t *drv,
                                            const lv_area_t *area,
                                            uint8_t *color_map);

static void display_bridge_v8_flush_double_full(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map);

static void display_bridge_v8_flush_triple_full(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map);

static void display_bridge_v8_flush_double_direct(esp_lv_adapter_display_bridge_v8_t *impl,
                                                  lv_disp_drv_t *drv,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map);

static void display_bridge_v8_flush_triple_diff(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map);

static void display_bridge_v8_flush_direct_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                  lv_disp_drv_t *drv,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map);

static void display_bridge_v8_flush_full_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map);

static void display_bridge_v8_flush_partial_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                   lv_disp_drv_t *drv,
                                                   const lv_area_t *area,
                                                   uint8_t *color_map);

static void rotate_copy_strided_region(const void *src,
                                       void *dst_fb,
                                       uint16_t lv_x_start,
                                       uint16_t lv_y_start,
                                       uint16_t lv_x_end,
                                       uint16_t lv_y_end,
                                       uint16_t src_stride_px,
                                       esp_lv_adapter_display_bridge_v8_t *impl);

static void rotate_copy_region(esp_lv_adapter_display_bridge_v8_t *impl,
                               const void *from,
                               void *to,
                               uint16_t x_start,
                               uint16_t y_start,
                               uint16_t x_end,
                               uint16_t y_end,
                               uint16_t src_logical_w,
                               uint16_t src_logical_h,
                               uint16_t dst_physical_w,
                               uint16_t dst_physical_h,
                               esp_lv_adapter_rotation_t rotation,
                               uint8_t color_bytes);

/* Helper functions */
static void copy_unrendered_area_from_front_to_back(lv_disp_t *disp_refr,
                                                    esp_lv_adapter_display_bridge_v8_t *impl);

static void copy_diff_repair_from_front_to_back(
    esp_lv_adapter_display_bridge_v8_t *impl,
    const lv_area_t *repair,
    uint16_t repair_count);

static bool display_bridge_v8_prepare_partial_back_buffer(
    esp_lv_adapter_display_bridge_v8_t *impl,
    lv_disp_t *disp_refr,
    bool dirty_to_physical,
    lv_area_t *current,
    uint16_t *current_count,
    uint8_t *target_index,
    bool *reset_tracker);

static void flush_dirty_save(esp_lv_adapter_display_dirty_region_t *dirty_area);

static void flush_dirty_copy(esp_lv_adapter_display_bridge_v8_t *impl,
                             void *dst,
                             void *src,
                             esp_lv_adapter_display_dirty_region_t *dirty_area);

#endif /* LVGL_VERSION_MAJOR < 9 */

/**********************
 *   PUBLIC API
 **********************/

/**
 * @brief Create LVGL v8 display bridge
 */
esp_lv_adapter_display_bridge_t *esp_lv_adapter_display_bridge_v8_create(const esp_lv_adapter_display_runtime_config_t *cfg)
{
#if LVGL_VERSION_MAJOR >= 9
    ESP_LOGE(TAG, "LVGL v8 bridge requires LVGL_VERSION_MAJOR < 9");
    (void)cfg;
    return NULL;
#else
    esp_lv_adapter_display_bridge_v8_t *impl = calloc(1, sizeof(*impl));
    if (!impl) {
        ESP_LOGE(TAG, "alloc bridge failed");
        return NULL;
    }

#if CONFIG_SOC_DMA2D_SUPPORTED || CONFIG_SOC_PPA_SUPPORTED
    static bool hw_resource_initialized = false;
    if (!hw_resource_initialized) {
        ESP_LOGI(TAG, "Initializing hardware resources (v8)");

