sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
    const bool was_enabled = impl->dummy_draw;
    impl->dummy_draw = enable;
    if (!enable) {
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;

        /* On real disable, align buf_act to the free buffer; skip the setup call. */
        lv_disp_t *disp = impl->cfg.lv_disp;
        lv_disp_drv_t *drv = disp ? disp->driver : NULL;
        lv_disp_draw_buf_t *draw_buf = drv ? drv->draw_buf : NULL;
        if (was_enabled && draw_buf &&
                impl->runtime.rotation == ESP_LV_ADAPTER_ROTATE_0 &&
                (impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_FULL ||
                 impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL ||
                 impl->cfg.base.tear_avoid_mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_DOUBLE_DIRECT)) {
            lv_color_t *target = NULL;

            if (draw_buf->buf1 == (lv_color_t *)impl->draw_fb) {
                target = draw_buf->buf1;
            } else if (draw_buf->buf2 == (lv_color_t *)impl->draw_fb) {
                target = draw_buf->buf2;
            } else if (draw_buf->buf1 == (lv_color_t *)impl->disp_fb && draw_buf->buf2) {
                draw_buf->buf2 = (lv_color_t *)impl->draw_fb;
                target = draw_buf->buf2;
            } else if (draw_buf->buf2 == (lv_color_t *)impl->disp_fb && draw_buf->buf1) {
                draw_buf->buf1 = (lv_color_t *)impl->draw_fb;
                target = draw_buf->buf1;
            } else if (draw_buf->buf2) {
                draw_buf->buf2 = (lv_color_t *)impl->draw_fb;
                target = draw_buf->buf2;
            } else if (draw_buf->buf1) {
                draw_buf->buf1 = (lv_color_t *)impl->draw_fb;
                target = draw_buf->buf1;
            }

            if (target) {
                draw_buf->buf_act = target;
            }
        }
    }
}

/**
 * @brief Update dummy draw callbacks
 */
static void display_bridge_v8_set_dummy_draw_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                       const esp_lv_adapter_dummy_draw_callbacks_t *cbs,
                                                       void *user_ctx)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl) {
        return;
    }

    if (cbs) {
        impl->cfg.dummy_draw_cbs = *cbs;
        impl->cfg.dummy_draw_user_ctx = user_ctx;
    } else {
        memset(&impl->cfg.dummy_draw_cbs, 0, sizeof(impl->cfg.dummy_draw_cbs));
        impl->cfg.dummy_draw_user_ctx = NULL;
    }
}

static esp_err_t display_bridge_v8_dummy_draw_blit(esp_lv_adapter_display_bridge_t *bridge,
                                                   int x_start,
                                                   int y_start,
                                                   int x_end,
                                                   int y_end,
                                                   const void *frame_buffer,
                                                   bool wait)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl || !frame_buffer || !impl->panel) {
        return ESP_ERR_INVALID_ARG;
    }

    if (x_start < 0 || y_start < 0 || x_end <= x_start || y_end <= y_start) {
        return ESP_ERR_INVALID_ARG;
    }

    uint32_t wait_mask = wait ? ESP_LV_ADAPTER_DUMMY_DRAW_EVT_COLOR_DONE : 0;

    if (!impl->dummy_draw) {
        return ESP_ERR_INVALID_STATE;
    }

    if (wait_mask != 0) {
        if (impl->dummy_draw_wait_task) {
            return ESP_ERR_INVALID_STATE;
        }
        impl->dummy_draw_wait_task = xTaskGetCurrentTaskHandle();
        impl->dummy_draw_wait_mask = wait_mask;
    } else {
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;
    }

    esp_err_t ret;
    if (impl->cfg.draw_bitmap_cbs.custom_draw_bitmap) {
        ret = impl->cfg.draw_bitmap_cbs.custom_draw_bitmap(impl->cfg.lv_disp, impl->panel,
                                                           x_start, y_start, x_end, y_end,
                                                           frame_buffer, impl->cfg.draw_bitmap_user_ctx);
    } else {
        ret = display_lcd_blit_area(impl->panel, x_start, y_start, x_end, y_end, frame_buffer);
    }
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit area failed: %s", esp_err_to_name(ret));
        impl->dummy_draw_wait_task = NULL;
        impl->dummy_draw_wait_mask = 0;
        return ret;
    }

    if (wait_mask == 0) {
        return ESP_OK;
    }

    uint32_t pending = wait_mask;
    while (pending != 0) {
        uint32_t events = 0;
        (void)xTaskNotifyWait(0, wait_mask, &events, portMAX_DELAY);
        pending &= ~events;
    }

    impl->dummy_draw_wait_task = NULL;
    impl->dummy_draw_wait_mask = 0;
    return ESP_OK;
}

static void *display_bridge_v8_dummy_draw_get_free_buf(esp_lv_adapter_display_bridge_t *bridge)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl || !impl->dummy_draw) {
        return NULL;
    }
    if (!bridge_mode_uses_buf_switch_release(impl->cfg.base.tear_avoid_mode)) {
        return NULL;
    }
    return impl->draw_fb;
}

/* Strategy 1: two-buffer DOUBLE_FULL / DOUBLE_DIRECT, wait for the panel switch. */
static esp_err_t display_bridge_v8_dummy_publish_double_wait(esp_lv_adapter_display_bridge_v8_t *impl,
                                                             void *frame_buffer)
{
    esp_err_t ret = display_bridge_v8_submit_double_buffer(impl, frame_buffer);
    if (ret != ESP_OK) {
        return ret;
    }
    void *old_disp = impl->disp_fb;
    impl->disp_fb = frame_buffer;
    impl->draw_fb = old_disp;
    return ESP_OK;
}

/* Strategy 2: TRIPLE_FULL, the ISR publishes pending_fb -> disp_fb on the switch. */
static esp_err_t display_bridge_v8_dummy_publish_triple_pending(esp_lv_adapter_display_bridge_v8_t *impl,
                                                                void *frame_buffer)
{
    TaskHandle_t prev_notify = impl->notify_task;
    impl->notify_task = xTaskGetCurrentTaskHandle();

    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, frame_buffer, true);
    if (ret != ESP_OK) {
        impl->notify_task = prev_notify;
        return ret;
    }

