sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
    portENTER_CRITICAL(&impl->pipeline.lock);
    impl->pending_fb = frame_buffer;
    portEXIT_CRITICAL(&impl->pipeline.lock);

    display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

    struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
    impl->notify_task = prev_notify;

    if (!next) {
        return ESP_ERR_NOT_FOUND;
    }
    impl->draw_fb = next->buffer;
    return ESP_OK;
}

/* Strategy 3: generic pipeline for partial and rotated modes, ISR releases a buffer. */
static esp_err_t display_bridge_v8_dummy_publish_pipeline(esp_lv_adapter_display_bridge_v8_t *impl,
                                                          void *frame_buffer)
{
    TaskHandle_t prev_notify = impl->notify_task;
    impl->notify_task = xTaskGetCurrentTaskHandle();

    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, frame_buffer, true);
    if (ret != ESP_OK) {
        impl->notify_task = prev_notify;
        return ret;
    }

    display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

    struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
    impl->notify_task = prev_notify;

    if (!next) {
        return ESP_ERR_NOT_FOUND;
    }
    impl->disp_fb = frame_buffer;
    impl->draw_fb = next->buffer;
    display_bridge_v8_diff_reset(impl);
    return ESP_OK;
}

static esp_err_t display_bridge_v8_dummy_draw_flush_buf(esp_lv_adapter_display_bridge_t *bridge,
                                                        void *frame_buffer)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl || !frame_buffer || !impl->panel || !impl->dummy_draw) {
        return ESP_ERR_INVALID_ARG;
    }

    const esp_lv_adapter_tear_avoid_mode_t mode = impl->cfg.base.tear_avoid_mode;
    if (!bridge_mode_uses_buf_switch_release(mode)) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (impl->draw_fb != frame_buffer) {
        ESP_LOGW(TAG, "dummy draw fb mismatch (arg=%p, draw_fb=%p)", frame_buffer, impl->draw_fb);
        impl->draw_fb = frame_buffer;
    }

    const bool rotated = bridge_mode_uses_rotated_nonpartial_pipeline_release(impl);
    if (!rotated && bridge_mode_uses_double_switch_wait(mode)) {
        return display_bridge_v8_dummy_publish_double_wait(impl, frame_buffer);
    }
    if (!rotated && mode == ESP_LV_ADAPTER_TEAR_AVOID_MODE_TRIPLE_FULL) {
        return display_bridge_v8_dummy_publish_triple_pending(impl, frame_buffer);
    }
    return display_bridge_v8_dummy_publish_pipeline(impl, frame_buffer);
}

/**
 * @brief Wrapper callback for area rounding (LVGL v8)
 */
static void rounder_cb_wrapper(lv_disp_drv_t *drv, lv_area_t *area)
{
    /* user_data points to display_node, get bridge from node */
    esp_lv_adapter_display_node_t *node = (esp_lv_adapter_display_node_t *)drv->user_data;
    if (!node || !node->bridge) {
        return;
    }

    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)node->bridge;
    const uint8_t color_bytes = bridge_color_bytes(impl);
    if (impl->cfg.rounder_cb) {
        impl->cfg.rounder_cb(area, impl->cfg.rounder_user_data);
    }
    /* Align area for encrypted external-RAM DMA. Checks source (draw_buf_primary)
     * and dest (draw_fb, stride-aligned only — unaligned stride falls back to CPU copy). */
    if (display_bridge_dma2d_buffer_needs_alignment(impl->cfg.draw_buf_primary) ||
            display_bridge_dma2d_x_rounding_sufficient(impl->draw_fb, drv->hor_res, color_bytes)) {
        display_bridge_align_area_for_enc_dma(area, drv->hor_res, color_bytes);
    }
}

/**
 * @brief Set area rounding callback
 */
static void display_bridge_v8_set_area_rounder(esp_lv_adapter_display_bridge_t *bridge,
                                               void (*rounder_cb)(lv_area_t *, void *),
                                               void *user_data)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl) {
        return;
    }

    impl->cfg.rounder_cb = rounder_cb;
    impl->cfg.rounder_user_data = user_data;

    lv_disp_drv_t *drv = impl->cfg.lv_disp ? impl->cfg.lv_disp->driver : NULL;
    if (drv) {
        /* draw_fb: require aligned stride; unaligned stride means rounding won't
         * enable DMA and the flush path already falls back to CPU copy. */
        const bool need_dma2d_rounder =
            display_bridge_dma2d_buffer_needs_alignment(impl->cfg.draw_buf_primary) ||
            display_bridge_dma2d_x_rounding_sufficient(impl->draw_fb,
                                                       bridge_h_res(impl),
                                                       bridge_color_bytes(impl));
        drv->rounder_cb = (rounder_cb || need_dma2d_rounder)
                          ? rounder_cb_wrapper : NULL;
    }
}

static void display_bridge_v8_set_draw_bitmap_callbacks(esp_lv_adapter_display_bridge_t *bridge,
                                                        const esp_lv_adapter_draw_bitmap_callbacks_t *cbs,
                                                        void *user_ctx)
{
    esp_lv_adapter_display_bridge_v8_t *impl = (esp_lv_adapter_display_bridge_v8_t *)bridge;
    if (!impl) {
        return;
    }

    if (cbs) {
        impl->cfg.draw_bitmap_cbs = *cbs;
        impl->cfg.draw_bitmap_user_ctx = user_ctx;
    } else {
        memset(&impl->cfg.draw_bitmap_cbs, 0, sizeof(impl->cfg.draw_bitmap_cbs));
        impl->cfg.draw_bitmap_user_ctx = NULL;
    }
}

/**********************
 *   DUMMY DRAW EVENTS
 **********************/

static inline void display_bridge_v8_signal_dummy_draw_event(esp_lv_adapter_display_bridge_v8_t *impl,
                                                             uint32_t event_bit,
                                                             BaseType_t *need_yield)
{
    if (!impl) {
        return;
    }
    if (!(impl->dummy_draw_wait_mask & event_bit)) {
        return;
    }
    TaskHandle_t task = impl->dummy_draw_wait_task;
    if (!task) {
        return;
    }
    xTaskNotifyFromISR(task, event_bit, eSetBits, need_yield);
}

static bool display_bridge_v8_has_pending_submit(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return false;
    }

    bool pending = false;
    portENTER_CRITICAL(&impl->pipeline.lock);
    pending = (impl->pending_fb != NULL);
    portEXIT_CRITICAL(&impl->pipeline.lock);
    return pending;
}

static void display_bridge_v8_wait_for_buf_switch(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return;
    }

