sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
#ifndef ESP_LCD_DPI_HAS_FRAME_BUF_COMPLETE_CB
        ESP_LOGW(TAG, "on_frame_buf_complete unavailable; buffer-switch release and dummy-draw may not function on MIPI DSI");
#endif
        esp_err_t ret = esp_lcd_dpi_panel_register_event_callbacks(impl->panel, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "register panel callbacks failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
#else
    break;
#endif
    case ESP_LV_ADAPTER_PANEL_IF_RGB:
#if CONFIG_SOC_LCD_RGB_SUPPORTED
    {
        esp_lcd_rgb_panel_event_callbacks_t cbs = {
            .on_color_trans_done = display_bridge_v8_on_rgb_color_trans_done,
            .on_frame_buf_complete = display_bridge_v8_on_rgb_frame_complete,
        };

        esp_err_t ret = esp_lcd_rgb_panel_register_event_callbacks(impl->panel, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "register panel callbacks failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
#else
        /* no RGB support, fallthrough to IO registration */
#endif
    default: {
        esp_lcd_panel_io_handle_t panel_io = impl->cfg.base.panel_io;
        if (!panel_io) {
            ESP_LOGW(TAG, "panel_io handle missing, skip IO callbacks");
            break;
        }

        esp_lcd_panel_io_callbacks_t cbs = {
            .on_color_trans_done = display_bridge_v8_on_io_color_trans_done,
        };
        esp_err_t ret = esp_lcd_panel_io_register_event_callbacks(panel_io, &cbs, impl);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "register panel IO callbacks failed (%d)", ret);
        } else {
            registered = true;
        }
        break;
    }
    }

    impl->idf_callbacks_registered = registered;
}

static void display_bridge_v8_unregister_vsync(esp_lv_adapter_display_bridge_v8_t *impl)
{
    if (!impl) {
        return;
    }

    if (!impl->idf_callbacks_registered) {
        return;
    }

    switch (impl->cfg.base.profile.interface) {
    case ESP_LV_ADAPTER_PANEL_IF_MIPI_DSI:
#if CONFIG_SOC_MIPI_DSI_SUPPORTED
    {
        if (!impl->panel) {
            break;
        }

        const esp_lcd_dpi_panel_event_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_dpi_panel_register_event_callbacks(impl->panel, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear panel callbacks (%d)", ret);
        }
        break;
    }
#else
    break;
#endif
    case ESP_LV_ADAPTER_PANEL_IF_RGB:
#if CONFIG_SOC_LCD_RGB_SUPPORTED
    {
        if (!impl->panel) {
            break;
        }

        const esp_lcd_rgb_panel_event_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_rgb_panel_register_event_callbacks(impl->panel, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear panel callbacks (%d)", ret);
        }
        break;
    }
#else
        /* no RGB support, fallthrough to IO unregistration */
#endif
    default: {
        esp_lcd_panel_io_handle_t panel_io = impl->cfg.base.panel_io;
        if (!panel_io) {
            break;
        }

        const esp_lcd_panel_io_callbacks_t cbs = {0};
        esp_err_t ret = esp_lcd_panel_io_register_event_callbacks(panel_io, &cbs, NULL);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to clear panel IO callbacks (%d)", ret);
        }
        break;
    }
    }

    impl->idf_callbacks_registered = false;
}

/**********************
 *   FLUSH IMPLEMENTATIONS
 **********************/

/**
 * @brief Default flush (single buffer, no tear protection)
 */
static void display_bridge_v8_flush_default(esp_lv_adapter_display_bridge_v8_t *impl,
                                            lv_disp_drv_t *drv,
                                            const lv_area_t *area,
                                            uint8_t *color_map)
{
    esp_lcd_panel_handle_t panel_handle = impl->panel;
    const int offsetx1 = area->x1;
    const int offsetx2 = area->x2;
    const int offsety1 = area->y1;
    const int offsety2 = area->y2;

    if (impl->cfg.draw_bitmap_cbs.custom_draw_bitmap) {
        esp_err_t ret = impl->cfg.draw_bitmap_cbs.custom_draw_bitmap(impl->cfg.lv_disp, panel_handle,
                                                                     offsetx1, offsety1, offsetx2 + 1, offsety2 + 1,
                                                                     color_map, impl->cfg.draw_bitmap_user_ctx);
        if (ret != ESP_OK) {
            if (ret == ESP_ERR_NOT_ALLOWED) {
                ESP_LOGD(TAG, "Custom draw bitmap not allowed, skipping");
            } else {
                ESP_LOGE(TAG, "Custom draw bitmap failed: %s", esp_err_to_name(ret));
            }
            display_manager_flush_ready(drv);
        }
    } else {
        esp_err_t ret = esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, color_map);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Draw bitmap failed: %s", esp_err_to_name(ret));
            /* Callback won't be triggered on failure, must notify LVGL immediately */
            display_manager_flush_ready(drv);
        }
    }
}

/**
 * @brief GPIO TE synchronized flush
 */
static void display_bridge_v8_flush_gpio_te(esp_lv_adapter_display_bridge_v8_t *impl,
                                            lv_disp_drv_t *drv,
                                            const lv_area_t *area,
                                            uint8_t *color_map)
{
    esp_lcd_panel_handle_t panel_handle = impl->panel;
    const int offsetx1 = area->x1;
    const int offsetx2 = area->x2;
    const int offsety1 = area->y1;
    const int offsety2 = area->y2;

    /* Prepare pixel data before waiting for TE to avoid window jitter */
    size_t flush_size = (size_t)lv_area_get_size(area) * bridge_color_bytes(impl);
#if CONFIG_SOC_PPA_SUPPORTED || CONFIG_SOC_DMA2D_SUPPORTED
    display_cache_msync_range(color_map, flush_size, hw_resource.data_cache_line_size);
#else
    display_cache_msync_range(color_map, flush_size, impl->cache_line_size);
#endif

    /* Notify TE sync to start a new frame */
    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_begin_frame(impl->cfg.te_ctx, flush_size);
    }

    /* Wait for TE signal to avoid tearing */
    if (impl->cfg.te_ctx) {
        (void)esp_lv_adapter_te_sync_wait_for_vsync(impl->cfg.te_ctx);
    }

    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_record_tx_start(impl->cfg.te_ctx);
    }

    /* Clear stale completion notifications before kicking off a new transfer. */
    ulTaskNotifyValueClear(NULL, ULONG_MAX);
    esp_err_t ret = esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, color_map);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Draw bitmap failed: %s", esp_err_to_name(ret));
        if (impl->cfg.te_ctx) {
            esp_lv_adapter_te_sync_record_tx_done(impl->cfg.te_ctx);
        }
        display_manager_flush_ready(drv);
        return;
    }

    /* Wait for transmission to complete */
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (impl->cfg.te_ctx) {
        esp_lv_adapter_te_sync_record_tx_done(impl->cfg.te_ctx);
    }

    display_manager_flush_ready(drv);
}

/**
 * @brief Double buffering with full-screen refresh
 */
static void display_bridge_v8_flush_double_full(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    (void)area;
    /* Action after last area refresh */
    if (drv->draw_buf->last_area) {
        esp_err_t ret = display_bridge_v8_submit_double_buffer(impl, color_map);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
            display_manager_flush_ready(drv);
            return;
        }
    }

    display_manager_flush_ready(drv);
}

