sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
static void display_bridge_v8_flush_triple_full(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    (void)area;
    lv_disp_draw_buf_t *draw_buf = drv->draw_buf;

    display_bridge_v8_wait_for_buf_switch(impl);

    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, color_map, false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
    } else {
        display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);
        portENTER_CRITICAL(&impl->pipeline.lock);
        impl->pending_fb = color_map;
        portEXIT_CRITICAL(&impl->pipeline.lock);

        struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
        if (!next) {
            display_manager_flush_ready(drv);
            return;
        }
        impl->draw_fb = next->buffer;

        if (draw_buf && draw_buf->buf2) {
            if (draw_buf->buf_act == draw_buf->buf1) {
                draw_buf->buf2 = (lv_color_t *)impl->draw_fb;
            } else {
                draw_buf->buf1 = (lv_color_t *)impl->draw_fb;
            }
        }
    }

    display_manager_flush_ready(drv);
}

/**
 * @brief Double buffering with direct mode
 */
static void display_bridge_v8_flush_double_direct(esp_lv_adapter_display_bridge_v8_t *impl,
                                                  lv_disp_drv_t *drv,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map)
{
    (void)area;

    if (lv_disp_flush_is_last(drv)) {
        esp_err_t ret = display_bridge_v8_submit_double_buffer(impl, color_map);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
            display_manager_flush_ready(drv);
            return;
        }
    }

    display_manager_flush_ready(drv);
}

/**
 * @brief Triple buffering with partial differential update
 */
static void display_bridge_v8_flush_triple_diff(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    uint8_t lvgl_color_format_bytes = bridge_color_bytes(impl);
    uint16_t lvgl_port_h_res = bridge_h_res(impl);
#if SOC_DMA2D_SUPPORTED
    uint16_t lvgl_port_v_res = bridge_v_res(impl);
#endif

#if SOC_DMA2D_SUPPORTED
    size_t rect_w = area->x2 - area->x1 + 1;
    size_t rect_h = area->y2 - area->y1 + 1;
    size_t src_stride_px = rect_w;
    size_t src_offset_x = 0;
    const bool can_use_dma2d =
        display_bridge_dma2d_window_is_compatible(color_map,
                                                  src_stride_px,
                                                  src_offset_x,
                                                  rect_w,
                                                  lvgl_color_format_bytes) &&
        display_bridge_dma2d_window_is_compatible(impl->draw_fb,
                                                  lvgl_port_h_res,
                                                  area->x1,
                                                  rect_w,
                                                  lvgl_color_format_bytes);

    if (can_use_dma2d) {
        size_t flush_size = src_stride_px * rect_h * lvgl_color_format_bytes;
        display_cache_msync_range(color_map, flush_size, hw_resource.data_cache_line_size);

#ifdef ESP_ASYNC_COLOR_CONVERT_AVAILABLE
        async_color_convert_request_t blit = {
            .src_buffer  = color_map,
            .dst_buffer  = impl->draw_fb,
            .src_stride  = src_stride_px,
            .src_height  = rect_h,
            .src_x       = src_offset_x,
            .src_y       = 0,
            .dst_stride  = lvgl_port_h_res,
            .dst_height  = lvgl_port_v_res,
            .dst_x       = area->x1,
            .dst_y       = area->y1,
            .copy_width  = rect_w,
            .copy_height = rect_h,
            DMA2D_PIXEL_FORMAT_FIELD(lvgl_color_format_bytes),
        };
#else
        esp_async_fbcpy_trans_desc_t blit = {
            .src_buffer        = color_map,
            .dst_buffer        = impl->draw_fb,
            .src_buffer_size_x = src_stride_px,
            .src_buffer_size_y = rect_h,
            .src_offset_x      = src_offset_x,
            .src_offset_y      = 0,
            .dst_buffer_size_x = lvgl_port_h_res,
            .dst_buffer_size_y = lvgl_port_v_res,
            .dst_offset_x      = area->x1,
            .dst_offset_y      = area->y1,
            .copy_size_x       = rect_w,
            .copy_size_y       = rect_h,
            DMA2D_PIXEL_FORMAT_FIELD(lvgl_color_format_bytes),
        };
#endif

        ESP_ERROR_CHECK(display_bridge_dma2d_copy_sync(&blit, portMAX_DELAY));
    } else {
#endif
        const int bytes_per_pixel = lvgl_color_format_bytes;
        const int bytes_per_line = lvgl_port_h_res * bytes_per_pixel;
        const int copy_bytes = (area->x2 - area->x1 + 1) * bytes_per_pixel;
        uint8_t *src = (uint8_t *)color_map;
        uint8_t *dst = (uint8_t *)impl->draw_fb + (area->y1 * lvgl_port_h_res + area->x1) * bytes_per_pixel;

        int num_rows = area->y2 - area->y1 + 1;
        bool is_full_width = (copy_bytes == bytes_per_line);

        if (is_full_width && num_rows > 4) {
            size_t total_bytes = (size_t)num_rows * bytes_per_line;
            memcpy(dst, src, total_bytes);
        } else if (num_rows > 16 && copy_bytes > 64) {
            const int batch_rows = 8;
            int full_batches = num_rows / batch_rows;
            int remaining_rows = num_rows % batch_rows;

            for (int batch = 0; batch < full_batches; batch++) {
                for (int r = 0; r < batch_rows; r++) {
                    memcpy(dst, src, copy_bytes);
                    dst += bytes_per_line;
                    src += copy_bytes;
                }
            }

            for (int r = 0; r < remaining_rows; r++) {
                memcpy(dst, src, copy_bytes);
                dst += bytes_per_line;
                src += copy_bytes;
            }
        } else if (copy_bytes == 2 && num_rows <= 8) {
            uint16_t *dst16 = (uint16_t *)dst;
            uint16_t *src16 = (uint16_t *)src;
            for (int y = 0; y < num_rows; y++) {
                *dst16 = *src16;
                dst16 += lvgl_port_h_res;
                src16++;
            }
        } else {
            for (int y = area->y1; y <= area->y2; y++) {
                memcpy(dst, src, copy_bytes);
                dst += bytes_per_line;
                src += copy_bytes;
            }
        }
#if SOC_DMA2D_SUPPORTED
    }
#endif

    if (lv_disp_flush_is_last(drv)) {
        lv_disp_t *disp_refr = _lv_refr_get_disp_refreshing();
        lv_area_t current[DISPLAY_BRIDGE_V8_DIFF_RECT_CAPACITY];
        uint16_t current_count = 0;
        uint8_t target_index = UINT8_MAX;
        bool reset_tracker = false;

