sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
        if (!display_bridge_v8_prepare_partial_back_buffer(
                    impl, disp_refr, false, current, &current_count,
                    &target_index, &reset_tracker)) {
            display_manager_flush_ready(drv);
            return;
        }

#if SOC_DMA2D_SUPPORTED
        display_cache_msync_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
        display_cache_msync_invalidate_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
#endif

        esp_err_t ret = display_bridge_v8_blit_full_frame(impl, impl->draw_fb, true);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
        } else {
            display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

            struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
            if (!next) {
                display_manager_flush_ready(drv);
                return;
            }
            impl->disp_fb = impl->draw_fb;
            impl->draw_fb = next->buffer;
            if (reset_tracker) {
                display_bridge_v8_diff_reset(impl);
            } else {
                display_bridge_v8_diff_commit(
                    impl, target_index, current, current_count);
            }
        }
#if CONFIG_ESP_LVGL_ADAPTER_PARTIAL_AUX_IMG_CACHE
        lv_img_cache_invalidate_src(NULL);
#endif
    }

    display_manager_flush_ready(drv);
}

/**
 * @brief Direct mode flush with rotation support (double buffering)
 */
static void display_bridge_v8_flush_direct_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                  lv_disp_drv_t *drv,
                                                  const lv_area_t *area,
                                                  uint8_t *color_map)
{
    if (!lv_disp_flush_is_last(drv)) {
        display_manager_flush_ready(drv);
        return;
    }

    flush_dirty_save(&impl->dirty);
    flush_dirty_copy(impl, impl->draw_fb, color_map, &impl->dirty);

    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, impl->draw_fb, false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
        display_manager_flush_ready(drv);
        return;
    }

    display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

    struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
    if (!next) {
        display_manager_flush_ready(drv);
        return;
    }
    impl->disp_fb = impl->draw_fb;
    impl->draw_fb = next->buffer;
    flush_dirty_copy(impl, impl->draw_fb, color_map, &impl->dirty);

    display_manager_flush_ready(drv);
}

/**
 * @brief Full refresh with rotation
 */
static void display_bridge_v8_flush_full_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                lv_disp_drv_t *drv,
                                                const lv_area_t *area,
                                                uint8_t *color_map)
{
    uint16_t logical_w = 0;
    uint16_t logical_h = 0;
    uint16_t physical_w = 0;
    uint16_t physical_h = 0;
    display_bridge_v8_get_rotation_geometry(impl, &logical_w, &logical_h, &physical_w, &physical_h);

    const int offsetx1 = area->x1;
    const int offsetx2 = area->x2;
    const int offsety1 = area->y1;
    const int offsety2 = area->y2;

    uint8_t color_bytes = bridge_color_bytes(impl);

    rotate_copy_region(impl, color_map, impl->draw_fb,
                       offsetx1, offsety1, offsetx2, offsety2,
                       logical_w, logical_h, physical_w, physical_h,
                       bridge_rotation(impl), color_bytes);

    esp_err_t ret = display_bridge_v8_blit_full_frame(impl, impl->draw_fb, false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
    } else {
        display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

        struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
        if (next) {
            impl->disp_fb = impl->draw_fb;
            impl->draw_fb = next->buffer;
        }
    }

    display_manager_flush_ready(drv);
}

/**
 * @brief Partial refresh with rotation
 */
static void display_bridge_v8_flush_partial_rotate(esp_lv_adapter_display_bridge_v8_t *impl,
                                                   lv_disp_drv_t *drv,
                                                   const lv_area_t *area,
                                                   uint8_t *color_map)
{
    size_t src_stride_px = area->x2 - area->x1 + 1;

    rotate_copy_strided_region(color_map,
                               impl->draw_fb,
                               area->x1, area->y1,
                               area->x2, area->y2,
                               src_stride_px,
                               impl);

    if (lv_disp_flush_is_last(drv)) {

        lv_disp_t *disp_refr = _lv_refr_get_disp_refreshing();
        lv_area_t current[DISPLAY_BRIDGE_V8_DIFF_RECT_CAPACITY];
        uint16_t current_count = 0;
        uint8_t target_index = UINT8_MAX;
        bool reset_tracker = false;

        if (!display_bridge_v8_prepare_partial_back_buffer(
                    impl, disp_refr, true, current, &current_count,
                    &target_index, &reset_tracker)) {
            display_manager_flush_ready(drv);
            return;
        }

#if CONFIG_SOC_PPA_SUPPORTED
        if (!hw_resource.ppa_handle) {
            display_cache_msync_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
        }
#else
        display_cache_msync_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
#endif
#if SOC_DMA2D_SUPPORTED || CONFIG_SOC_PPA_SUPPORTED
        display_cache_msync_invalidate_framebuffer(impl->draw_fb, impl->runtime.frame_buffer_size);
#endif

        esp_err_t ret = display_bridge_v8_blit_full_frame(impl, impl->draw_fb, true);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Blit failed: %s", esp_err_to_name(ret));
        } else {
            display_bridge_pipeline_mark_buf_busy(&impl->pipeline, impl->disp_fb);

            struct display_pipeline_buf *next = display_bridge_pipeline_wait_free_buf(&impl->pipeline);
            if (!next) {
                display_manager_flush_ready(drv);
                return;
            }
            impl->disp_fb = impl->draw_fb;
            impl->draw_fb = next->buffer;
            if (reset_tracker) {
                display_bridge_v8_diff_reset(impl);
            } else {
                display_bridge_v8_diff_commit(
                    impl, target_index, current, current_count);
            }
        }
#if CONFIG_ESP_LVGL_ADAPTER_PARTIAL_AUX_IMG_CACHE
        lv_img_cache_invalidate_src(NULL);
#endif
    }

    /* Notify LVGL that flush is complete */
    display_manager_flush_ready(drv);
}

/**********************
 *   ROTATION & COPY OPERATIONS
 **********************/

/**
 * @brief Rotate and copy region with stride support (uses PPA if available)
 */
static void IRAM_ATTR rotate_copy_strided_region(const void *src, void *dst_fb,
                                                 uint16_t lv_x_start, uint16_t lv_y_start,
                                                 uint16_t lv_x_end,   uint16_t lv_y_end,
                                                 uint16_t src_stride_px,
                                                 esp_lv_adapter_display_bridge_v8_t *impl)
{
    esp_lv_adapter_rotation_t rotation = bridge_rotation(impl);
    uint16_t hor_res = bridge_h_res(impl);
    uint16_t ver_res = bridge_v_res(impl);
    uint8_t color_bytes = bridge_color_bytes(impl);

#if CONFIG_SOC_PPA_SUPPORTED
    if (hw_resource.ppa_handle && (color_bytes == COLOR_BYTES_RGB565 || color_bytes == COLOR_BYTES_RGB888)) {
        const size_t rect_w = lv_x_end - lv_x_start + 1;
        const size_t rect_h = lv_y_end - lv_y_start + 1;

        int block_w_final    = rect_w;
        int block_h_final    = rect_h;
        int block_off_x_final = 0;
        int block_off_y_final = 0;

