sashok53011/OmniChat-Android/esp32-p4-firmware/managed_components/espressif__esp_lvgl_adapter/src/display/bridge/v8/lvgl_bridge_v8.c
#if SOC_DMA2D_SUPPORTED
    const uint16_t ver_res = bridge_v_res(impl);
    if (repair_count != 0) {
        display_cache_msync_framebuffer(impl->disp_fb,
                                        impl->runtime.frame_buffer_size);
    }
#endif

    for (uint16_t index = 0; index < repair_count; ++index) {
        lv_area_t rect = repair[index];
        size_t copy_w_px = (size_t)(rect.x2 - rect.x1 + 1);
        size_t copy_h_px = (size_t)(rect.y2 - rect.y1 + 1);

#if SOC_DMA2D_SUPPORTED
        if (display_bridge_dma2d_window_is_compatible(
                    impl->disp_fb, hor_res, rect.x1, copy_w_px, color_bytes) &&
                display_bridge_dma2d_window_is_compatible(
                    impl->draw_fb, hor_res, rect.x1, copy_w_px,
                    color_bytes)) {
#ifdef ESP_ASYNC_COLOR_CONVERT_AVAILABLE
            async_color_convert_request_t transfer = {
                .src_buffer = impl->disp_fb,
                .dst_buffer = impl->draw_fb,
                .src_stride = hor_res,
                .src_height = ver_res,
                .dst_stride = hor_res,
                .dst_height = ver_res,
                .src_x = rect.x1,
                .src_y = rect.y1,
                .dst_x = rect.x1,
                .dst_y = rect.y1,
                .copy_width = copy_w_px,
                .copy_height = copy_h_px,
                DMA2D_PIXEL_FORMAT_FIELD(color_bytes),
            };
#else
            esp_async_fbcpy_trans_desc_t transfer = {
                .src_buffer = impl->disp_fb,
                .dst_buffer = impl->draw_fb,
                .src_buffer_size_x = hor_res,
                .src_buffer_size_y = ver_res,
                .src_offset_x = rect.x1,
                .src_offset_y = rect.y1,
                .dst_buffer_size_x = hor_res,
                .dst_buffer_size_y = ver_res,
                .dst_offset_x = rect.x1,
                .dst_offset_y = rect.y1,
                .copy_size_x = copy_w_px,
                .copy_size_y = copy_h_px,
                DMA2D_PIXEL_FORMAT_FIELD(color_bytes),
            };
#endif
            ESP_ERROR_CHECK(display_bridge_dma2d_copy_sync(
                                &transfer, portMAX_DELAY));
            continue;
        }
#endif

        size_t copy_bytes = copy_w_px * color_bytes;
        uint8_t *src = (uint8_t *)impl->disp_fb +
                       ((size_t)rect.y1 * hor_res + rect.x1) * color_bytes;
        uint8_t *dst = (uint8_t *)impl->draw_fb +
                       ((size_t)rect.y1 * hor_res + rect.x1) * color_bytes;
        for (size_t row = 0; row < copy_h_px; ++row) {
            memcpy(dst, src, copy_bytes);
            src += (size_t)hor_res * color_bytes;
            dst += (size_t)hor_res * color_bytes;
        }
    }
}

static bool display_bridge_v8_prepare_partial_back_buffer(
    esp_lv_adapter_display_bridge_v8_t *impl,
    lv_disp_t *disp_refr,
    bool dirty_to_physical,
    lv_area_t *current,
    uint16_t *current_count,
    uint8_t *target_index,
    bool *reset_tracker)
{
    lv_area_t repair[DISPLAY_BRIDGE_V8_REPAIR_CAPACITY];
    uint16_t repair_count = 0;
    uint16_t pending_count = 0;
    uint8_t source_index = UINT8_MAX;
    bool copy_baseline = true;

    *current_count = 0;
    *target_index = UINT8_MAX;
    *reset_tracker = false;

    bool current_valid = disp_refr != NULL &&
                         display_bridge_v8_diff_capture_current(
                             impl, disp_refr, current, current_count, dirty_to_physical);
    *target_index =
        display_bridge_v8_diff_buffer_index(impl, impl->draw_fb);
    source_index =
        display_bridge_v8_diff_buffer_index(impl, impl->disp_fb);
    *reset_tracker = !current_valid || *target_index == UINT8_MAX ||
                     source_index == UINT8_MAX;

    if (!*reset_tracker) {
        display_bridge_v8_diff_buffer_t *target =
            &impl->diff_tracker.buffers[*target_index];
        pending_count = target->pending_count;
        if (target->valid && display_bridge_v8_diff_subtract(
                    target->pending, target->pending_count,
                    current, *current_count, repair, &repair_count)) {
            display_bridge_v8_diff_buffer_t *source =
                &impl->diff_tracker.buffers[source_index];
            if (repair_count == 0 ||
                    (source->valid &&
                     source->revision == impl->diff_tracker.revision)) {
                copy_baseline = false;
            } else {
                *reset_tracker = true;
            }
        }
    }

    ESP_LOGD(TAG,
             "partial diff: rotated=%u target=%u source=%u baseline=%u"
             " pending=%u current=%u repair=%u revision=%" PRIu32,
             (unsigned)dirty_to_physical, (unsigned)*target_index,
             (unsigned)source_index, (unsigned)copy_baseline,
             (unsigned)pending_count, (unsigned)*current_count,
             (unsigned)repair_count, impl->diff_tracker.revision);
    for (uint16_t index = 0; index < repair_count && !copy_baseline; ++index) {
        ESP_LOGV(TAG,
                 "  repair[%u]: (%" PRId32 ",%" PRId32
                 ")-(%" PRId32 ",%" PRId32 ") size=%" PRId32
                 "x%" PRId32,
                 (unsigned)index,
                 (int32_t)repair[index].x1,
                 (int32_t)repair[index].y1,
                 (int32_t)repair[index].x2,
                 (int32_t)repair[index].y2,
                 (int32_t)(repair[index].x2 - repair[index].x1 + 1),
                 (int32_t)(repair[index].y2 - repair[index].y1 + 1));
    }

    if (copy_baseline) {
        if (disp_refr == NULL) {
            ESP_LOGE(TAG, "No refreshing display for partial baseline");
            return false;
        }
        copy_unrendered_area_from_front_to_back(disp_refr, impl);
    } else {
        copy_diff_repair_from_front_to_back(impl, repair, repair_count);
    }

    return true;
}

/**
 * @brief Copy unrendered areas from front buffer to back buffer
 */
static void copy_unrendered_area_from_front_to_back(lv_disp_t *disp_refr, esp_lv_adapter_display_bridge_v8_t *impl)
{
    uint16_t hor_res = bridge_h_res(impl);
    uint16_t ver_res = bridge_v_res(impl);
    uint8_t color_bytes = bridge_color_bytes(impl);
    esp_lv_adapter_rotation_t rotation = bridge_rotation(impl);

